Lectures.org
#+SETUPFILE: ./setup.org
#+HUGO_SECTION: slides
#+HUGO_MENU: :menu main :parent Assignments
#+REVEAL_SINGLE_FILE: t
#+REVEAL_ROOT: file:///home/matt/src/reveal.js
#+ORG_LMS_SECTION: lecture
# #+OPTIONS: reveal_single_file:t

* 3.2 Encoding Text -- TEI
:PROPERTIES:
:EXPORT_FILE_NAME: 03-02-encoding-text
:END:
** Encodings
- HTML is a text encoming system
- but of course there are many others, often with different purposes!
- HTML is a *web standard* but there are other *standards*
- [[https://tei-c.org/][TEI]] is an influential standard designed *by and for* humanists for *encoding textual complexity*
** TEI is XML
- the *eXtensible Markup Language* looks a bit like HTML but is much more complex
- remains a key technology in many domains (e.g., your word docs and powerpoints slides are written in XML)
- built with similar syntax but much, much more powerful
- also *way* harder to read

#+begin_src xml
  <book category="children">
    <title>Harry Potter</title>
    <author>J K. Rowling</author>
    <year>2005</year>
    <price>29.99</price>
  </book>
#+end_src

(trivial example)
** Real TEI
:PROPERTIES:
:reveal_extra_attr: class="twoc"
:END:
#+begin_slideblock
#+begin_src xml

<lg type="poem">
  <lg type="stanza">
    <l>
      <rhyme>Poppadom</rhyme>
    </l>
    <l>
      <rhyme>Oatmeal</rhyme>
    </l>
    <l>Bubble <rhyme>gum</rhyme> </l>
    <l>Cut of <rhyme>veal</rhyme> </l>
  </lg>
  <lg type="stanza">
    <l>Mince for <rhyme>pie</rhyme> </l>
    <l>Frozen <rhyme>peas</rhyme> </l>
    <l>Video for <rhyme>Guy</rhyme> </l>
    <l>Selection of <rhyme>teas</rhyme> </l>
  </lg>
  <lg type="stanza">
    <l>Paper towels/garbage <rhyme>bags</rhyme> </l>
    <l>Pasta sauce and <rhyme>Parmesan</rhyme> </l>
    <l>Pumpkin seed and olive <rhyme>oil</rhyme> </l>
  </lg>
  <lg type="stanza">
    <l>Cheesy crisps and favourite <rhyme>mags</rhyme> </l>
    <l>Kidney beans (1 large <rhyme>can</rhyme>)</l>
    <l>Cling film and kitchen <rhyme>foil</rhyme> </l>
  </lg>
</lg>
#+end_src

#+end_slideblock

#+begin_slideblock

- all these tags are *defined in a standard* which is [[https://tei-c.org/guidelines/p5/][available online]] in a readable format but *also is a machine-readable standard for XML interpreters*
- The power of XML/TEI (like that of HTML) comes in part from that *machine-readable standard*
#+end_slideblock

 
** Using TEI
- we won't!
- but you might want to if:
  - you want to record textual complexities in a rigourous format
  - you hope to collaborate with others/make your work useful to others
  - you want to join a scholarly community around precise textual analysis

- our work in the class is *theatically similar* even if we don't use the *same technlogy*
