03-02-encoding-text.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>3.2 Encoding Text &#x2013; TEI</title>
<meta name="author" content="Matt Price"/>
<link rel="stylesheet" href="file:///home/matt/src/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:///home/matt/src/reveal.js/css/theme/matt.css" id="theme"/>
<link rel="stylesheet" href="file:///home/matt/src/reveal.js/lib/css/zenburn.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>3.2 Encoding Text &#x2013; TEI</h1>
<h3>Matt Price  </h3>
<!-- <p class="title-theme-choice">(view this presentation in another theme: 
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/black.css')); return false;">Black (default)</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/white.css')); return false;">White</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/league.css')); return false;">League</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/sky.css')); return false;">Sky</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/beige.css')); return false;">Beige</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/simple.css')); return false;">Simple</a> 
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/serif.css')); return false;">Serif</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/blood.css')); return false;">Blood</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/night.css')); return false;">Night</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/moon.css')); return false;">Moon</a> -
<a href="#" onclick="document.getElementById('theme').setAttribute('href',document.getElementById('theme').getAttribute('href').replace(/\/[a-zA-Z]+\.css/g,'/solarized.css')); return false;">Solarized</a> 
				)	</p> -->

</section>
<section>
<section id="slide-org6b6f707">
<h2 id="org6b6f707">Encodings</h2>
<form><ul>
<li>HTML is a text encoming system</li>
<li>but of course there are many others, often with different purposes!</li>
<li>HTML is a <b>web standard</b> but there are other <b>standards</b></li>
<li><a href="https://tei-c.org/">TEI</a> is an influential standard designed <b>by and for</b> humanists for <b>encoding textual complexity</b></li>

</ul></form>
</section>
</section>
<section>
<section id="slide-org4be6a1f">
<h2 id="org4be6a1f">TEI is XML</h2>
<form><ul>
<li>the <b>eXtensible Markup Language</b> looks a bit like HTML but is much more complex</li>
<li>remains a key technology in many domains (e.g., your word docs and powerpoints slides are written in XML)</li>
<li>built with similar syntax but much, much more powerful</li>
<li>also <b>way</b> harder to read</li>

</ul></form>

<div class="org-src-container">

<pre><code class=" xml" >&lt;book category="children"&gt;
  &lt;title&gt;Harry Potter&lt;/title&gt;
  &lt;author&gt;J K. Rowling&lt;/author&gt;
  &lt;year&gt;2005&lt;/year&gt;
  &lt;price&gt;29.99&lt;/price&gt;
&lt;/book&gt;
</code></pre>
</div>

<p>
(trivial example)
</p>
</section>
</section>
<section>
<section id="slide-org7f74b28" class="twoc">
<h2 id="org7f74b28">Real TEI</h2>
<div class="slideblock">
<div class="org-src-container">

<pre><code class=" xml" >
&lt;lg type="poem"&gt;
  &lt;lg type="stanza"&gt;
    &lt;l&gt;
      &lt;rhyme&gt;Poppadom&lt;/rhyme&gt;
    &lt;/l&gt;
    &lt;l&gt;
      &lt;rhyme&gt;Oatmeal&lt;/rhyme&gt;
    &lt;/l&gt;
    &lt;l&gt;Bubble &lt;rhyme&gt;gum&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Cut of &lt;rhyme&gt;veal&lt;/rhyme&gt; &lt;/l&gt;
  &lt;/lg&gt;
  &lt;lg type="stanza"&gt;
    &lt;l&gt;Mince for &lt;rhyme&gt;pie&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Frozen &lt;rhyme&gt;peas&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Video for &lt;rhyme&gt;Guy&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Selection of &lt;rhyme&gt;teas&lt;/rhyme&gt; &lt;/l&gt;
  &lt;/lg&gt;
  &lt;lg type="stanza"&gt;
    &lt;l&gt;Paper towels/garbage &lt;rhyme&gt;bags&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Pasta sauce and &lt;rhyme&gt;Parmesan&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Pumpkin seed and olive &lt;rhyme&gt;oil&lt;/rhyme&gt; &lt;/l&gt;
  &lt;/lg&gt;
  &lt;lg type="stanza"&gt;
    &lt;l&gt;Cheesy crisps and favourite &lt;rhyme&gt;mags&lt;/rhyme&gt; &lt;/l&gt;
    &lt;l&gt;Kidney beans (1 large &lt;rhyme&gt;can&lt;/rhyme&gt;)&lt;/l&gt;
    &lt;l&gt;Cling film and kitchen &lt;rhyme&gt;foil&lt;/rhyme&gt; &lt;/l&gt;
  &lt;/lg&gt;
&lt;/lg&gt;
</code></pre>
</div>

</div>

<div class="slideblock">
<p>

</p>

<form><ul>
<li>all these tags are <b>defined in a standard</b> which is <a href="https://tei-c.org/guidelines/p5/">available online</a> in a readable format but <b>also is a machine-readable standard for XML interpreters</b></li>
<li>The power of XML/TEI (like that of HTML) comes in part from that <b>machine-readable standard</b></li>

</ul></form>

</div>


</section>
</section>
<section>
<section id="slide-orgf290334">
<h2 id="orgf290334">Using TEI</h2>
<form><ul>
<li>we won&rsquo;t!</li>
<li>but you might want to if:
<form><ul>
<li>you want to record textual complexities in a rigourous format</li>
<li>you hope to collaborate with others/make your work useful to others</li>
<li>you want to join a scholarly community around precise textual analysis</li>

</ul></form></li>

<li>our work in the class is <b>theatically similar</b> even if we don&rsquo;t use the <b>same technlogy</b></li>

</ul></form>
</section>
</section>
</div>
</div>
<script src="file:///home/matt/src/reveal.js/lib/js/head.min.js"></script>
<script src="file:///home/matt/src/reveal.js/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: false,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,
width: "100%",
height: "100%",
margin: 0.10,
minScale: 1.00,
maxScale: 1.00,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'convex', // see README of reveal.js for options
transitionSpeed: 'default',

// Optional libraries used to extend reveal.js
dependencies: [
{src: 'file:///home/matt/src/reveal.js/plugin/klipse_reveal.js'},
 { src: 'file:///home/matt/src/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:///home/matt/src/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///home/matt/src/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///home/matt/src/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'file:///home/matt/src/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:///home/matt/src/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]

});
</script>
</body>
</html>
